Masmiseim36/nxpSDK/devices/MK22FA12/mcuxpresso/startup_mk22fa12.cpp
    // Chip Level - MK22FA12
    DMA0_IRQHandler,                      // 16: DMA Channel 0 Transfer Complete
    DMA1_IRQHandler,                      // 17: DMA Channel 1 Transfer Complete
    DMA2_IRQHandler,                      // 18: DMA Channel 2 Transfer Complete
    DMA3_IRQHandler,                      // 19: DMA Channel 3 Transfer Complete
    DMA4_IRQHandler,                      // 20: DMA Channel 4 Transfer Complete
    DMA5_IRQHandler,                      // 21: DMA Channel 5 Transfer Complete
    DMA6_IRQHandler,                      // 22: DMA Channel 6 Transfer Complete
    DMA7_IRQHandler,                      // 23: DMA Channel 7 Transfer Complete
    DMA8_IRQHandler,                      // 24: DMA Channel 8 Transfer Complete
    DMA9_IRQHandler,                      // 25: DMA Channel 9 Transfer Complete
    DMA10_IRQHandler,                     // 26: DMA Channel 10 Transfer Complete
    DMA11_IRQHandler,                     // 27: DMA Channel 11 Transfer Complete
    DMA12_IRQHandler,                     // 28: DMA Channel 12 Transfer Complete
    DMA13_IRQHandler,                     // 29: DMA Channel 13 Transfer Complete
    DMA14_IRQHandler,                     // 30: DMA Channel 14 Transfer Complete
    DMA15_IRQHandler,                     // 31: DMA Channel 15 Transfer Complete
    DMA_Error_IRQHandler,                 // 32: DMA Error Interrupt
    MCM_IRQHandler,                       // 33: Normal Interrupt
    FTFE_IRQHandler,                      // 34: FTFE Command complete interrupt
    Read_Collision_IRQHandler,            // 35: Read Collision Interrupt
    LVD_LVW_IRQHandler,                   // 36: Low Voltage Detect, Low Voltage Warning
    LLWU_IRQHandler,                      // 37: Low Leakage Wakeup Unit
    WDOG_EWM_IRQHandler,                  // 38: WDOG Interrupt
    Reserved39_IRQHandler,                // 39: Reserved interrupt
    I2C0_IRQHandler,                      // 40: I2C0 interrupt
    I2C1_IRQHandler,                      // 41: I2C1 interrupt
    SPI0_IRQHandler,                      // 42: SPI0 Interrupt
    SPI1_IRQHandler,                      // 43: SPI1 Interrupt
    I2S0_Tx_IRQHandler,                   // 44: I2S0 transmit interrupt
    I2S0_Rx_IRQHandler,                   // 45: I2S0 receive interrupt
    Reserved46_IRQHandler,                // 46: Reserved interrupt
    UART0_RX_TX_IRQHandler,               // 47: UART0 Receive/Transmit interrupt
    UART0_ERR_IRQHandler,                 // 48: UART0 Error interrupt
    UART1_RX_TX_IRQHandler,               // 49: UART1 Receive/Transmit interrupt
    UART1_ERR_IRQHandler,                 // 50: UART1 Error interrupt
    UART2_RX_TX_IRQHandler,               // 51: UART2 Receive/Transmit interrupt
    UART2_ERR_IRQHandler,                 // 52: UART2 Error interrupt
    UART3_RX_TX_IRQHandler,               // 53: UART3 Receive/Transmit interrupt
    UART3_ERR_IRQHandler,                 // 54: UART3 Error interrupt
    ADC0_IRQHandler,                      // 55: ADC0 interrupt
    CMP0_IRQHandler,                      // 56: CMP0 interrupt
    CMP1_IRQHandler,                      // 57: CMP1 interrupt
    FTM0_IRQHandler,                      // 58: FTM0 fault, overflow and channels interrupt
    FTM1_IRQHandler,                      // 59: FTM1 fault, overflow and channels interrupt
    FTM2_IRQHandler,                      // 60: FTM2 fault, overflow and channels interrupt
    CMT_IRQHandler,                       // 61: CMT interrupt
    RTC_IRQHandler,                       // 62: RTC interrupt
    RTC_Seconds_IRQHandler,               // 63: RTC seconds interrupt
    PIT0_IRQHandler,                      // 64: PIT timer channel 0 interrupt
    PIT1_IRQHandler,                      // 65: PIT timer channel 1 interrupt
    PIT2_IRQHandler,                      // 66: PIT timer channel 2 interrupt
    PIT3_IRQHandler,                      // 67: PIT timer channel 3 interrupt
    PDB0_IRQHandler,                      // 68: PDB0 Interrupt
    USB0_IRQHandler,                      // 69: USB0 interrupt
    USBDCD_IRQHandler,                    // 70: USBDCD Interrupt
    Reserved71_IRQHandler,                // 71: Reserved interrupt
    DAC0_IRQHandler,                      // 72: DAC0 interrupt
    MCG_IRQHandler,                       // 73: MCG Interrupt
    LPTMR0_IRQHandler,                    // 74: LPTimer interrupt
    PORTA_IRQHandler,                     // 75: Port A interrupt
    PORTB_IRQHandler,                     // 76: Port B interrupt
    PORTC_IRQHandler,                     // 77: Port C interrupt
    PORTD_IRQHandler,                     // 78: Port D interrupt
    PORTE_IRQHandler,                     // 79: Port E interrupt
    SWI_IRQHandler,                       // 80: Software interrupt
    SPI2_IRQHandler,                      // 81: SPI2 Interrupt
    UART4_RX_TX_IRQHandler,               // 82: UART4 Receive/Transmit interrupt
    UART4_ERR_IRQHandler,                 // 83: UART4 Error interrupt
    UART5_RX_TX_IRQHandler,               // 84: UART5 Receive/Transmit interrupt
    UART5_ERR_IRQHandler,                 // 85: UART5 Error interrupt
    CMP2_IRQHandler,                      // 86: CMP2 interrupt
    FTM3_IRQHandler,                      // 87: FTM3 fault, overflow and channels interrupt
    DAC1_IRQHandler,                      // 88: DAC1 interrupt
    ADC1_IRQHandler,                      // 89: ADC1 interrupt
    I2C2_IRQHandler,                      // 90: I2C2 interrupt
    CAN0_ORed_Message_buffer_IRQHandler,  // 91: CAN0 OR'd message buffers interrupt
    CAN0_Bus_Off_IRQHandler,              // 92: CAN0 bus off interrupt
    CAN0_Error_IRQHandler,                // 93: CAN0 error interrupt
    CAN0_Tx_Warning_IRQHandler,           // 94: CAN0 Tx warning interrupt
    CAN0_Rx_Warning_IRQHandler,           // 95: CAN0 Rx warning interrupt
    CAN0_Wake_Up_IRQHandler,              // 96: CAN0 wake up interrupt
    SDHC_IRQHandler,                      // 97: SDHC interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int *pulSrc = (unsigned int*) romstart;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();
#else
    // Disable Watchdog
    //  Write 0xC520 to watchdog unlock register
    *((volatile unsigned short *)0x4005200E) = 0xC520;
    //  Followed by 0xD928 to complete the unlock
    *((volatile unsigned short *)0x4005200E) = 0xD928;
    // Now disable watchdog via STCTRLH register
    *((volatile unsigned short *)0x40052000) = 0x01D2u;
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
	unsigned int LoadAddr, ExeAddr, SectionLen;
	unsigned int *SectionTableAddr;

